{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 320, 180, 3], "name": "input_5", "sparse": false}, "name": "input_5"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_377", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_377"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_377", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_377", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_377"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_377", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_377"}, "name": "activation_377"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_377", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_378", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_378"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_378", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_378", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_378"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_378", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_378"}, "name": "activation_378"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_378", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_379", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_379"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_379", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_379", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_379"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_379", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_379"}, "name": "activation_379"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_379", 0, 0, {}]]], "config": {"name": "max_pooling2d_17", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_17"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_17", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_380", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 80, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_380"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_380", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_380", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_380"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_380", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_380"}, "name": "activation_380"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_380", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_381", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 192, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_381"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_381", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_381", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_381"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_381", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_381"}, "name": "activation_381"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_381", 0, 0, {}]]], "config": {"name": "max_pooling2d_18", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_18"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_385", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_385"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_385", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_385", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_385"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_385", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_385"}, "name": "activation_385"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_383", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_383"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_385", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_386", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_386"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_383", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_383", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_383"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_386", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_386", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_386"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_383", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_383"}, "name": "activation_383"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_386", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_386"}, "name": "activation_386"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}]]], "config": {"name": "average_pooling2d_37", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "name": "average_pooling2d_37"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_18", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_382", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_382"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_383", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_384", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "name": "conv2d_384"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_386", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_387", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_387"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_37", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_388", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_388"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_382", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_382", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_382"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_384", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_384", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_384"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_387", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_387", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_387"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_388", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_388", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_388"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_382", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_382"}, "name": "activation_382"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_384", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_384"}, "name": "activation_384"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_387", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_387"}, "name": "activation_387"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_388", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_388"}, "name": "activation_388"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_382", 0, 0, {}], ["activation_384", 0, 0, {}], ["activation_387", 0, 0, {}], ["activation_388", 0, 0, {}]]], "config": {"trainable": true, "name": "mixed0", "axis": 3}, "name": "mixed0"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_392", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_392"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_392", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_392", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_392"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_392", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_392"}, "name": "activation_392"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_390", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_390"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_392", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_393", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_393"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_390", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_390", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_390"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_393", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_393", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_393"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_390", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_390"}, "name": "activation_390"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_393", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_393"}, "name": "activation_393"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"name": "average_pooling2d_38", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "name": "average_pooling2d_38"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_389", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_389"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_390", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_391", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "name": "conv2d_391"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_393", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_394", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_394"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_38", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_395", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_395"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_389", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_389", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_389"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_391", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_391", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_391"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_394", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_394", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_394"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_395", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_395", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_395"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_389", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_389"}, "name": "activation_389"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_391", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_391"}, "name": "activation_391"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_394", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_394"}, "name": "activation_394"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_395", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_395"}, "name": "activation_395"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_389", 0, 0, {}], ["activation_391", 0, 0, {}], ["activation_394", 0, 0, {}], ["activation_395", 0, 0, {}]]], "config": {"trainable": true, "name": "mixed1", "axis": 3}, "name": "mixed1"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_399", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_399"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_399", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_399", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_399"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_399", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_399"}, "name": "activation_399"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_397", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 48, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_397"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_399", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_400", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_400"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_397", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_397", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_397"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_400", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_400", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_400"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_397", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_397"}, "name": "activation_397"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_400", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_400"}, "name": "activation_400"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"name": "average_pooling2d_39", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "same", "strides": [1, 1]}, "name": "average_pooling2d_39"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_396", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_396"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_397", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_398", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [5, 5]}, "name": "conv2d_398"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_400", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_401", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_401"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_39", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_402", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_402"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_396", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_396", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_396"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_398", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_398", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_398"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_401", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_401", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_401"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_402", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_402", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_402"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_396", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_396"}, "name": "activation_396"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_398", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_398"}, "name": "activation_398"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_401", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_401"}, "name": "activation_401"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_402", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_402"}, "name": "activation_402"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_396", 0, 0, {}], ["activation_398", 0, 0, {}], ["activation_401", 0, 0, {}], ["activation_402", 0, 0, {}]]], "config": {"trainable": true, "name": "mixed2", "axis": 3}, "name": "mixed2"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_404", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_404"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_404", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_404", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_404"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_404", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_404"}, "name": "activation_404"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_404", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_405", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_405"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_405", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_405", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_405"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_405", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_405"}, "name": "activation_405"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_403", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 384, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_403"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_405", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_406", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 96, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_406"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_403", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_403", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_403"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_406", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_406", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_406"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_403", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_403"}, "name": "activation_403"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_406", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_406"}, "name": "activation_406"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"name": "max_pooling2d_19", "trainable": true, "data_format": "channels_last", "pool_size": [3, 3], "padding": "valid", "strides": [2, 2]}, "name": "max_pooling2d_19"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_403", 0, 0, {}], ["activation_406", 0, 0, {}], ["max_pooling2d_19", 0, 0, {}]]], "config": {"trainable": true, "name": "mixed3", "axis": 3}, "name": "mixed3"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_411", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_411"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_411", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_411", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, "beta_regularizer": null, "momentum": 0.99, "axis": 3}, "name": "batch_normalization_411"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_411", 0, 0, {}]]], "config": {"activation": "relu", "trainable": true, "name": "activation_411"}, "name": "activation_411"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_411", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_412", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "data_format": "channels_last", "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": false, "activity_regularizer": null, "kernel_size": [7, 1]}, "name": "conv2d_412"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_412", 0, 0, {}]]], "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_412", "epsilon": 0.001, "trainable": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null, 